Q.2						
You are given sales and product table as mentioned above write python code to find
the category that has maximum sales amount								
return category name, and max sale amount?

In [2]:
import pandas as pd

In [3]:
# Datasets
products_data = {
    'product_id': [1, 2, 3, 4, 5],
    'product_name': ['Laptop', 'Smartphone', 'Desk Chair', 'Coffee Table', 'Blender'],
    'category': ['Electronics', 'Electronics', 'Furniture', 'Furniture', 'Home Appliances']
}
products_df = pd.DataFrame(products_data)

# Creating the sales DataFrame
sales_data = {
    'sale_id': [101, 102, 103, 104, 105, 106, 107, 108],
    'product_id': [1, 2, 3, 4, 1, 2, 3, 5],
    'sale_amount': [1200, 800, 150, 200, 1300, 850, 160, 100]
}
sales_df = pd.DataFrame(sales_data)

In [18]:
products_df

   product_id  product_name         category
0           1        Laptop      Electronics
1           2    Smartphone      Electronics
2           3    Desk Chair        Furniture
3           4  Coffee Table        Furniture
4           5       Blender  Home Appliances

In [19]:
sales_df

   sale_id  product_id  sale_amount
0      101           1         1200
1      102           2          800
2      103           3          150
3      104           4          200
4      105           1         1300
5      106           2          850
6      107           3          160
7      108           5          100

In [21]:
df = pd.merge(products_df, sales_df, how='inner', on='product_id')

df.groupby('category')['sale_amount'].max()

category
Electronics        1300
Furniture           200
Home Appliances     100
Name: sale_amount, dtype: int64

# Challenge Question

In [12]:
# Can you return max sale amount and total sale as below

          category  max_sale_amt  total_sale
0      Electronics          1300        4150
1        Furniture           200         510
2  Home Appliances           100         100